-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-05-05 18:10:06
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `testdb`
--

-- --------------------------------------------------------

--
-- 資料表結構 `section_table`
--

CREATE TABLE `section_table` (
  `course_id` varchar(4) DEFAULT NULL,
  `sec_id` varchar(4) DEFAULT NULL,
  `semester` int(1) DEFAULT NULL,
  `year` int(4) DEFAULT NULL,
  `building` varchar(2) DEFAULT NULL,
  `room_number` int(3) DEFAULT NULL,
  `time_slot_id` varchar(9) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `section_table`
--

INSERT INTO `section_table` (`course_id`, `sec_id`, `semester`, `year`, `building`, `room_number`, `time_slot_id`) VALUES
('1992', '1992', 2, 2023, '資電', 502, '(一)01-03'),
('1261', '1261', 2, 2023, '資電', 402, '(一)06'),
('1261', '1261', 2, 2023, '資電', 504, '(二)03-04'),
('1262', '1262', 2, 2023, '資電', 404, '(一)07'),
('2523', '2523', 2, 2023, '忠', 208, '(一)08-10'),
('1290', '1290', 2, 2023, '資電', 234, '(二)11-13'),
('3546', '3546', 2, 2023, '資電', 234, '(三)03-04'),
('1237', '1237', 2, 2023, '忠', 307, '(三)08-09'),
('1237', '1237', 2, 2023, '資電', 504, '(四)01'),
('2522', '2522', 2, 2023, '忠', 302, '(四)02 '),
('1211', '1211', 2, 2023, '科航', 204, '(四)03-04'),
('1211', '1211', 2, 2023, '資電', 234, '(五)01-04'),
('1259', '1259', 2, 2023, '資電', 306, '(四)06'),
('1296', '1296', 2, 2023, '資電', 234, '(六)03-04'),
('1260', '1260', 2, 2023, '資電', 306, '(一)03-04'),
('3545', '3545', 2, 2023, '資電', 404, '(一)09-10'),
('3545', '3545', 2, 2023, '資電', 104, '(四)03'),
('3543', '3543', 2, 2023, '資電', 125, '(二)06-07'),
('3543', '3543', 2, 2023, '資電', 102, '(四)02'),
('2920', '2920', 2, 2023, '忠', 309, '(三)03-04'),
('3537', '3537', 2, 2023, '圖', 213, '(三)09-10'),
('3552', '3552', 2, 2023, '資電', 404, '(三)11-13 '),
('3547', '3547', 2, 2023, '資電', 234, '(四)09-10'),
('3228', '3228', 2, 2023, '人', 607, '(五)02-04'),
('2861', '2861', 2, 2023, '語', 105, '(二)08-09'),
('2701', '2701', 2, 2023, '資電', 102, '(二)10-11'),
('1269', '1269', 2, 2023, '資電', 234, '(三)09-10'),
('3221', '3221', 2, 2023, '人', 507, '(五)02-04'),
('3383', '3383', 2, 2023, '人', 504, '(二)06'),
('3418', '3418', 2, 2023, '人', 504, '(二)07'),
('0750', '0750', 2, 2023, '圖', 213, '(二)11-12'),
('2774', '2774', 2, 2023, '人', 407, '(三)06-07'),
('3219', '3219', 2, 2023, '人', 407, '(五)02-04');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
