-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-05-05 18:10:06
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `testdb`
--

-- --------------------------------------------------------

--
-- 資料表結構 `section_table`
--

CREATE TABLE `section_table` (
  `course_id` varchar(4) DEFAULT NULL,
  `sec_id` varchar(4) DEFAULT NULL,
  `semester` int(1) DEFAULT NULL,
  `year` int(4) DEFAULT NULL,
  `building` varchar(2) DEFAULT NULL,
  `room_number` int(3) DEFAULT NULL,
  `time_slot_id` varchar(3) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `section_table`
--

INSERT INTO `section_table` (`course_id`, `sec_id`, `semester`, `year`, `building`, `room_number`, `time_slot_id`) VALUES
('1992', '1992', 2, 2023, '資電', 502, '1'),
('1261', '1261', 2, 2023, '資電', 402, '3'),
('1261', '1261', 2, 2023, '資電', 504, '7'),
('1262', '1262', 2, 2023, '資電', 404, '4'),
('1262', '1262', 2, 2023, '資電', 404, '30'),
('2523', '2523', 2, 2023, '忠', 208, '5'),
('1290', '1290', 2, 2023, '資電', 234, '14'),
('3546', '3546', 2, 2023, '資電', 234, '15'),
('1237', '1237', 2, 2023, '忠', 307, '17'),
('1237', '1237', 2, 2023, '資電', 504, '23'),
('2522', '2522', 2, 2023, '忠', 302, '24'),
('1211', '1211', 2, 2023, '科航', 204, '26'),
('1211', '1211', 2, 2023, '資電', 234, '20'),
('1259', '1259', 2, 2023, '資電', 306, '28'),
('1296', '1296', 2, 2023, '資電', 234, '22'),
('1260', '1260', 2, 2023, '資電', 306, '2'),
('1260', '1260', 2, 2023, '資電', 103, '27'),
('3545', '3545', 2, 2023, '資電', 404, '6'),
('3545', '3545', 2, 2023, '資電', 104, '25'),
('3543', '3543', 2, 2023, '資電', 125, '9'),
('3543', '3543', 2, 2023, '資電', 102, '24'),
('2920', '2920', 2, 2023, '忠', 309, '15'),
('3537', '3537', 2, 2023, '圖', 213, '18'),
('3552', '3552', 2, 2023, '資電', 404, '19'),
('3547', '3547', 2, 2023, '資電', 234, '29'),
('3228', '3228', 2, 2023, '人', 607, '21'),
('2861', '2861', 2, 2023, '語', 105, '11'),
('2701', '2701', 2, 2023, '資電', 102, '12'),
('1269', '1269', 2, 2023, '資電', 234, '18'),
('3221', '3221', 2, 2023, '人', 507, '21'),
('3383', '3383', 2, 2023, '人', 504, '8'),
('3418', '3418', 2, 2023, '人', 504, '10'),
('0750', '0750', 2, 2023, '圖', 213, '13'),
('2774', '2774', 2, 2023, '人', 407, '16'),
('3219', '3219', 2, 2023, '人', 407, '21'),
('1212', '1212', 2, 2023, '科航', '204', '26'),
('1212', '1212', 2, 2023, '資電', '234', '20');

COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
